In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('tested.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [22]:
df.shape

(418, 12)

In [72]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [26]:
df.groupby('Sex')['Sex'].count()

Sex
female    152
male      266
Name: Sex, dtype: int64

In [25]:
df.groupby('Sex')['Sex'].count()/df.shape[0]*100

Sex
female    36.363636
male      63.636364
Name: Sex, dtype: float64

####  Q1 How many total passengers is titanic ? 
There are total of 418 passenger out of which  152 Female and 266 Male in the dataset  with percentage of 36% F and 63% M

In [31]:
df.groupby('Age')['Sex'].count().sort_values(ascending=False)

Age
21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
34.0     1
34.5     1
36.5     1
38.5     1
76.0     1
Name: Sex, Length: 79, dtype: int64

#### Q2 What are the most age groups of  passengers in titanic?
21 ,22 ,24 and 30 age group passenger

In [41]:
df[df['Fare']==df['Fare'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C

####  Q3 Who's fare is the most expensive in titanic ?
Cardeza, Mrs. James Warburton Martinez (Charlo. a female who's fare 512.3292 is the maximum fare in titanic dataset and there age is 58

In [57]:
df.groupby('Pclass')['Sex'].count()

Pclass
1    107
2     93
3    218
Name: Sex, dtype: int64

#### Q4 Group by passengers from There class?
There are 107 passenger from class 1 /

93 passenger from class 2 and 

218 from class 3

In [64]:
df[df.loc[:,'SibSp']==df['SibSp'].max()]['Name']

188                Sage, Miss. Ada
360    Sage, Master. William Henry
Name: Name, dtype: object

#### Q5 There  is a couple who has maximum number of siblings in Titanic ? Who are they 
188 ID                Sage, Miss. Ada Female

360 ID   Sage, Master. William Henry Male

In [67]:
df.groupby('Embarked').count()['PassengerId']/df.shape[0]*100

Embarked
C    24.401914
Q    11.004785
S    64.593301
Name: PassengerId, dtype: float64

#### Q6  How many passengers from C = Cherbourg Q = Queenstown S = Southampton ?
64% from S/Southampton

24% from C/Cherbourg 

11% from Q/Queenstown

In [73]:
df['Cabin'].isna().sum()

327

#### Q7 How many cabin information is not listed in dataset of Titanic?
There are 327 passenger who's cabin information is not there

In [93]:
df.sort_values(by='Fare',ascending=False).head(10)['Name']

343    Cardeza, Mrs. James Warburton Martinez (Charlo...
53                            Fortune, Miss. Ethel Flora
69                   Fortune, Mrs. Mark (Mary McDougald)
24       Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
142                           Ryerson, Mr. Arthur Larned
59                           Chaudanson, Miss. Victorine
64                           Ryerson, Master. John Borie
375                             Bowen, Miss. Grace Scott
184    Douglas, Mrs. Frederick Charles (Mary Helene B...
202                               Astor, Col. John Jacob
Name: Name, dtype: object

#### Q8 show me top 10 passenger name who has maximum fare in titanic?
343    Cardeza, Mrs. James Warburton Martinez (Charlo...


53                            Fortune, Miss. Ethel Flora


69                   Fortune, Mrs. Mark (Mary McDougald)


24       Ryerson, Mrs. Arthur Larned (Emily Maria Borie)


142                           Ryerson, Mr. Arthur 


59                           Chaudanson, Miss. Victorine


64                           Ryerson, Master. John Borie


375                             Bowen, Miss. Grace Scott


184    Douglas, Mrs. Frederick Charles (Mary Helene B...


202                               Astor, Col. John Jacob

In [98]:
df.sort_values(by='Parch',ascending=False).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
365,1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,NaN,1,9,CA. 2343,69.55,NaN,S
342,1234,0,3,"Sage, Mr. John George",male,NaN,1,9,CA. 2343,69.55,NaN,S

####  Q9 Parch for parent child ! now tell me the passenger age,sex and name who has maximum Parch?
name:Sage, Mrs. John (Annie Bullen)	sex:female	age:NaN Parch:9

name:Sage, Mr. John George	sex:male	age:NaN	Parch:9

In [101]:
df.groupby('Sex')['Fare'].median()

Sex
female    21.5125
male      13.0000
Name: Fare, dtype: float64

#### Q10 tell us avg of male and female ticket fare?
female    21.5125

male      13.0000